<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.2" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="思考," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.2" />






<meta name="description" content="&amp;#x9605;&amp;#x8BFB;&amp;#x6750;&amp;#x6599;&amp;#x4E00;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x4F60;&amp;#x5E94;&amp;#x8BE5;&amp;#xFF08;&amp;#x4ECE;&amp;#x73B0;&amp;#x5728;&amp;#x5F00;&amp;#x59CB;&amp;#x5C31;&amp;#xFF09;&amp;#x5199;&amp;#x535A;&amp;#x5BA2;, By &amp;#x5218;&amp;#x672A;&amp;#x">
<meta name="keywords" content="思考">
<meta property="og:type" content="article">
<meta property="og:title" content="无效而琐碎的思考">
<meta property="og:url" content="http://jingchen2222.github.io./2018/09/19/读书笔记/关于无效的碎片思考/index.html">
<meta property="og:site_name" content="Chen22&#39;S BLOG">
<meta property="og:description" content="&amp;#x9605;&amp;#x8BFB;&amp;#x6750;&amp;#x6599;&amp;#x4E00;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x4F60;&amp;#x5E94;&amp;#x8BE5;&amp;#xFF08;&amp;#x4ECE;&amp;#x73B0;&amp;#x5728;&amp;#x5F00;&amp;#x59CB;&amp;#x5C31;&amp;#xFF09;&amp;#x5199;&amp;#x535A;&amp;#x5BA2;, By &amp;#x5218;&amp;#x672A;&amp;#x">
<meta property="og:locale" content="zh-Hans">
<meta property="og:updated_time" content="2018-09-20T14:11:07.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="无效而琐碎的思考">
<meta name="twitter:description" content="&amp;#x9605;&amp;#x8BFB;&amp;#x6750;&amp;#x6599;&amp;#x4E00;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x4F60;&amp;#x5E94;&amp;#x8BE5;&amp;#xFF08;&amp;#x4ECE;&amp;#x73B0;&amp;#x5728;&amp;#x5F00;&amp;#x59CB;&amp;#x5C31;&amp;#xFF09;&amp;#x5199;&amp;#x535A;&amp;#x5BA2;, By &amp;#x5218;&amp;#x672A;&amp;#x">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://jingchen2222.github.io./2018/09/19/读书笔记/关于无效的碎片思考/"/>


  <title> 无效而琐碎的思考 | Chen22'S BLOG </title><!-- hexo-inject:begin --><!-- hexo-inject:end -->
</head>

<body itemscope itemtype="//schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="//schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Chen22'S BLOG</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-schedule">
          <a href="/schedule" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-calendar"></i> <br />
            
            日程
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="//schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                无效而琐碎的思考
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2018-09-19T00:00:00+08:00" content="2018-09-19">
              2018-09-19
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/读书笔记/" itemprop="url" rel="index">
                    <span itemprop="name">读书笔记</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h4 id="&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E00;"><a href="#&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E00;" class="headerlink" title="&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E00;"></a>&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E00;</h4><p><a href="http://mindhacks.cn/2009/02/15/why-you-should-start-blogging-now/" target="_blank" rel="noopener">&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x5E94;&#x8BE5;&#xFF08;&#x4ECE;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x5C31;&#xFF09;&#x5199;&#x535A;&#x5BA2;, By &#x5218;&#x672A;&#x9E4F; | Mind Hacks<br>&#x601D;&#x7EF4;&#x6539;&#x53D8;&#x751F;&#x6D3B;</a></p>
<blockquote>
<p>&#x6211;&#x66FE;&#x5728;CSDN&#x4E0A;&#x5199;&#x4E86;&#x8FD1;&#x516D;&#x5E74;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x5728;&#x4E00;&#x5E74;&#x534A;&#x524D;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;Google Groups&#xFF08;TopLanguage&#xFF09;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x7684;&#x957F;&#x671F;&#x9605;&#x8BFB;&#x8005;&#x90FD;&#x662F;&#x4E92;&#x76F8;&#x6709;&#x5171;&#x540C;&#x8BED;&#x8A00;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;Group&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x70ED;&#x706B;&#x671D;&#x5929;&#xFF0C;&#x800C;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x6280;&#x672F;&#x8BA8;&#x8BBA;&#x5219;&#x8FDB;&#x4E00;&#x6B65;&#x5438;&#x5F15;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x725B;&#x4EBA;&#x7684;&#x53C2;&#x4E0E;&#xFF0C;&#x96EA;&#x7403;&#x6EDA;&#x8D77;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x505C;&#x4E0B;&#x6765;&#x4E86;&#xFF0C;&#x5C06;&#x8FD1;&#x4E00;&#x5E74;&#x534A;&#x4E0B;&#x6765;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;Group&#x7684;&#x8BA8;&#x8BBA;&#x4E2D;&#x6211;&#x83B7;&#x76CA;&#x826F;&#x591A;[1]&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x4E3A;&#x4E86;&#x8BA9;&#x4E00;&#x4E2A;&#x4E0D;&#x660E;&#x767D;&#x7684;&#x4EBA;&#x505A;&#x5230;&#x660E;&#x767D;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x77E5;&#x9053;&#x4ECE;&#x660E;&#x767D;&#x5230;&#x4E0D;&#x660E;&#x767D;&#x4ED6;&#x7A76;&#x7ADF;&#x9700;&#x8981;&#x638C;&#x63E1;&#x54EA;&#x4E9B;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x5C31;&#x8FEB;&#x4F7F;&#x6211;&#x4EEC;&#x5BF9;&#x6211;&#x4EEC;&#x5927;&#x8111;&#x4E2D;&#x6574;&#x4E2A;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x6765;&#x4E2A;&#x5BFB;&#x6839;&#x7A76;&#x5E95;&#xFF0C;&#x628A;&#x85CF;&#x5728;&#x6C34;&#x9762;&#x4E4B;&#x4E0B;&#x7684;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x7EDF;&#x7EDF;&#x6316;&#x51FA;&#x6765;&#xFF0C;&#x628A;&#x5927;&#x8111;&#x4E2D;&#x7684;&#x90A3;&#x4E9B;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x3001;&#x4F46;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x77E5;&#x9053;&#x7684;&#x6F5C;&#x5728;&#x6982;&#x5FF5;&#x6216;&#x5047;&#x8BBE;&#xFF08;assumptions&#xFF09;&#x90FD;&#x6316;&#x51FA;&#x6765;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x4ECE;&#x5185;&#x9690;&#x8BB0;&#x5FC6;&#x62C9;&#x626F;&#x5230;&#x5916;&#x663E;&#x8BB0;&#x5FC6;&#x4E2D;&#x3002;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x5B8C;&#x5168;&#x77E5;&#x9053;&#x3001;&#x5E76;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x77E5;&#x9053;&#x4E00;&#x5207;&#x6765;&#x9F99;&#x53BB;&#x8109;&#x7684;&#x4EBA;&#xFF0C;&#x624D;&#x80FD;&#x771F;&#x6B63;&#x628A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x8BB2;&#x5F97;&#x901A;&#x901A;&#x900F;&#x900F;&#x3002;</p>
</blockquote>
<a id="more"></a>
<blockquote>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x201C;&#x6211;&#x5F3A;&#x70C8;&#x5730;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x8BF4;&#x6CD5;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x6211;&#x5374;&#x8BF4;&#x4E0D;&#x6E05;&#x5B83;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x5230;&#x5E95;&#x54EA;&#x6709;&#x95EE;&#x9898;&#x201D;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x6781;&#x6709;&#x610F;&#x4E49;&#x7684;&#x77AC;&#x95F4;&#xFF0C;&#x5B83;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5BF9;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x8BA4;&#x8BC6;&#x6709;&#x6F5C;&#x5728;&#x7684;&#x504F;&#x5DEE;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x90FD;&#x6CA1;&#x6709;&#x89C9;&#x77E5;&#x5230;&#x7684;&#x5730;&#x65B9;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x6F5C;&#x5728;&#x7684;&#x5047;&#x8BBE;&#x3001;&#x5077;&#x6362;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x6982;&#x5FF5;</p>
</blockquote>
<blockquote>
<p>&#x8BA9;&#x4F60;&#x81EA;&#x5DF1;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x6301;&#x7EED;&#x5B66;&#x4E60;&#x548C;&#x601D;&#x8003;&#x7684;&#x4EBA;&#xFF0C;&#x5E76;&#x53EA;&#x5199;&#x4F60;&#x771F;&#x6B63;&#x601D;&#x8003;&#x548C;&#x603B;&#x7ED3;&#x4E4B;&#x540E;&#x7684;&#x4EA7;&#x7269;&#xFF0C;&#x5176;&#x4ED6;&#x4E00;&#x5207;&#x5C31;&#x4F1A;&#x968F;&#x4E4B;&#x800C;&#x6765;&#x3002;<br>&#x5C31;&#x50CF;&#x90A3;&#x53E5;&#x7ECF;&#x5E38;&#x88AB;&#x4EBA;&#x4F20;&#x9605;&#x7684;&#x8BDD;&#xFF1A;&#x53EA;&#x505A;&#x4F60;&#x6700;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x94B1;&#x4F1A;&#x968F;&#x4E4B;&#x800C;&#x6765;[2]&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x2026; &#x6211;&#x60F3;&#x518D;&#x91CD;&#x590D;&#x4E00;&#x4E0B;&#x7684;&#x662F;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x788E;&#x788E;&#x5FF5;&#xFF0C;&#x6211;&#x80FD;&#x7406;&#x89E3;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x60F3;&#x5076;&#x5C14;&#x53D1;&#x53D1;&#x7262;&#x9A9A;&#x7684;&#x51B2;&#x52A8;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7A97;&#x53E3;&#xFF1A;twitter&#xFF0C;&#x6240;&#x4EE5;&#x7ACB;&#x5373;&#x505C;&#x6B62;&#x5728;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x4E0A;&#x788E;&#x788E;&#x5FF5;&#xFF0C;&#x9605;&#x8BFB;&#x535A;&#x5BA2;&#x7684;&#x4EBA;&#x5E0C;&#x671B;&#x5F97;&#x5230;&#x4FE1;&#x606F;&#x800C;&#x975E;&#x566A;&#x97F3;&#x3002;&#x5982;&#x679C;&#x5B9E;&#x5728;&#x5FCD;&#x4E0D;&#x4F4F;&#x60F3;&#x788E;&#x788E;&#x5FF5;&#x7684;&#x8BDD;&#x4E0D;&#x59A8;&#x6362;&#x4E00;&#x4E0B;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x4E48;&#x6765;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x770B;&#x5230;&#x522B;&#x4EBA;&#x535A;&#x5BA2;&#x6765;&#x4E0A;&#x8FD9;&#x4E48;&#x4E00;&#x6BB5;&#xFF0C;&#x4F60;&#x4F1A;&#x6709;&#x5174;&#x8DA3;&#x770B;&#x5417;&#xFF1F;</p>
</blockquote>
<blockquote>
<p>Much of intelligence is knowledge&#xFF0C;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x53D1;&#x4EBA;&#x6DF1;&#x7701;&#x7684;&#x7ECF;&#x5178;&#x5FC3;&#x7406;&#x5B66;&#x5B9E;&#x9A8C;[4]&#xFF1A;</p>
<p>&#x5C06;&#x5B69;&#x5B50;&#x4EEC;&#x5206;&#x6210;&#x4E24;&#x7EC4;&#xFF0C;&#x901A;&#x8FC7;&#x7ED9;&#x4ED6;&#x4EEC;&#x4E0D;&#x540C;&#x7684;&#x9605;&#x8BFB;&#x6750;&#x6599;&#x8BA9;&#x4E00;&#x7EC4;&#x76F8;&#x4FE1;&#x667A;&#x529B;&#x662F;&#x5929;&#x751F;&#x7684;&#xFF0C;&#x4E0D;&#x53EF;&#x5728;&#x540E;&#x5929;&#x6539;&#x53D8;&#x7684;&#xFF0C;&#x53E6;&#x4E00;&#x7EC4;&#x5219;&#x8BA9;&#x4ED6;&#x4EEC;&#x76F8;&#x4FE1;&#x667A;&#x529B;&#x5176;&#x5B9E;&#x53EA;&#x662F;&#x77E5;&#x8BC6;&#x548C;&#x6280;&#x80FD;&#x7684;&#x4EE3;&#x540D;&#x8BCD;&#xFF0C;&#x5B8C;&#x5168;&#x662F;&#x540E;&#x5929;&#x4E60;&#x5F97;&#x7684;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x8BA9;&#x4ED6;&#x4EEC;&#x505A;&#x4E00;&#x7EC4;&#x4EFB;&#x52A1;&#xFF0C;&#x90A3;&#x4E9B;&#x88AB;&#x76F8;&#x4FE1;&#x667A;&#x529B;&#x5929;&#x751F;&#x8BF4;&#x7684;&#x5B69;&#x5B50;&#xFF0C;&#x503E;&#x5411;&#x4E8E;&#x56DE;&#x907F;&#x56F0;&#x96BE;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x9009;&#x62E9;&#x8F83;&#x5BB9;&#x6613;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x903B;&#x8F91;&#x60F3;&#x5FC5;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x5982;&#x679C;&#x505A;&#x56F0;&#x96BE;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5C31;&#x589E;&#x5927;&#x4E86;&#x5931;&#x8D25;&#x7684;&#x51E0;&#x7387;&#xFF0C;&#x5C31;&#x5728;&#x964D;&#x4F4E;&#x4E86;&#x81EA;&#x5DF1;&#x5728;&#x522B;&#x4EBA;&#x548C;&#x81EA;&#x5DF1;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x667A;&#x529B;&#x7684;&#x503C;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x62A4;&#x8FD9;&#x4E2A;&#x667A;&#x529B;&#x7684;&#x503C;&#x4E0D;&#x88AB;&#x964D;&#x4F4E;&#xFF0C;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x90A3;&#x4E9B;&#x6709;&#x5931;&#x8D25;&#x98CE;&#x9669;&#x7684;&#x9879;&#x76EE;&#x3002;&#x800C;&#x53E6;&#x4E00;&#x7EC4;&#x5B69;&#x5B50;&#x5219;&#x5BF9;&#x4E8E;&#x6709;&#x6311;&#x6218;&#x6027;&#x7684;&#x4E8B;&#x60C5;&#x8DC3;&#x8DC3;&#x6B32;&#x8BD5;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5931;&#x8D25;&#x7684;&#x65F6;&#x5019;&#x660E;&#x663E;&#x6CA1;&#x6709;&#x524D;&#x8005;&#x6CAE;&#x4E27;&#xFF0C;&#x56E0;&#x4E3A;&#x5931;&#x8D25;&#x4E5F;&#x662F;&#x5B66;&#x5F97;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x7BA1;&#x600E;&#x6837;&#x90FD;&#x662F;&#x201C;&#x667A;&#x529B;&#x201D;&#x7684;&#x63D0;&#x9AD8;&#x3002;</p>
</blockquote>
<h4 id="&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E8C;"><a href="#&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E8C;" class="headerlink" title="&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E8C;"></a>&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E8C;</h4><p><a href="http://mindhacks.cn/2009/02/09/writing-is-better-thinking/" target="_blank" rel="noopener">&#x4E66;&#x5199;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x601D;&#x8003;&#xFF0C;By &#x5218;&#x672A;&#x9E4F;</a></p>
<h4 id="&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E09;"><a href="#&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E09;" class="headerlink" title="&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E09;"></a>&#x9605;&#x8BFB;&#x6750;&#x6599;&#x4E09;</h4><p><a href="https://groups.google.com/forum/#!topic/pongba/b2FAdEq5XHI" target="_blank" rel="noopener">Re: {OT}&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x80FD;&#x8BF4;&#x6E05;&#x695A;&#xFF0C;&#x5341;&#x6709;&#x516B;&#x4E5D;&#x4F60;&#x5C31;&#x4F5C;&#x4E0D;&#x597D;, Top language</a></p>
<blockquote>
<p>&#x56E0;&#x4E3A;&#x968F;&#x7740;&#x4EBA;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x7ECF;&#x9A8C;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x5730;&#x4F9D;&#x9760;&#x7ECF;&#x9A8C;&#x6765;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x7ECF;&#x9A8C;&#x6709;&#x4E9B;&#x662F;&#x81EA;&#x5DF1;&#x8EAB;&#x4F53;&#x529B;&#x884C;&#xFF0C;<br>&#x5B9E;&#x8DF5;&#x5F97;&#x6765;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x5219;&#x662F;&#x9053;&#x542C;&#x9014;&#x8BF4;&#xFF0C;&#x7ECF;&#x5377;&#x7EB8;&#x4F20;&#xFF0C;&#x4ECE;&#x5176;&#x4ED6;&#x7684;&#x5730;&#x65B9;&#x83B7;&#x5F97;&#x7684;&#x3002;&#x5728;&#x83B7;&#x5F97;&#x8FD9;&#x4E9B;&#x7ECF;&#x9A8C;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x4F1A;&#x5EFA;&#x7ACB;&#x8D77;<br>&#x2026;</p>
<p>&#x2026; &#x4E8E;&#x662F;&#xFF0C;&#x5728;&#x9047;&#x5230;&#x4E86;&#x4E0E;&#x81EA;&#x5DF1;&#x4EE5;&#x524D;&#x7ECF;&#x5386;&#x8FC7;&#x7684;&#x95EE;&#x9898;&#x76F8;&#x4F3C;&#xFF0C;&#x76F8;&#x8FD1;&#x7684;&#x573A;&#x666F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x6761;&#x4EF6;&#x53CD;&#x5C04;&#x5730;&#x57FA;&#x4E8E;&#x5DF2;&#x6709;&#x7ECF;&#x9A8C;&#xFF0C;&#x8BBE;&#x8BA1;&#x51FA;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;work&#x5F97;&#x5F88;&#x597D;&#x3002;&#x4F46;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x867D;&#x7136;&#x80FD;work&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x6700;&#x4F18;&#x89E3;&#xFF0C;&#x751A;&#x81F3;<br>&#x81EA;&#x5DF1;&#x90FD;&#x672A;&#x5FC5;&#x80FD;&#x8BF4;&#x5F97;&#x6E05;&#x695A;&#x4E3A;&#x4EC0;&#x4E48;&#x7ED9;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6848;&#x3002; </p>
</blockquote>
<blockquote>
<p>&#x5728;&#x4F5C;&#x8BBE;&#x8BA1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x662F;&#x65E7;&#x6709;&#x7ECF;&#x9A8C;&#x4F5C;&#x795F;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5219;&#x662F;&#x56E0;&#x4E3A;&#x5077;&#x61D2;&#x7684;&#x60C5;&#x7EEA;&#x5360;&#x4E86;&#x4E0A;&#x98CE;&#xFF0C;&#x81EA;&#x5DF1;&#x4F1A;&#x6EE1;&#x8DB3;&#x4E8E;&#x6D45;&#x5C1D;&#x8F84; </p>
</blockquote>
<p>&#x4E60;&#x60EF;&#x57FA;&#x4E8E;&#x7ECF;&#x9A8C;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x53CD;&#x601D;&#x548C;&#x63A8;&#x6572;&#x8FD9;&#x6761;&#x7ECF;&#x9A8C;&#xFF0C;&#x4F1A;&#x4F7F;&#x5F97;&#x81EA;&#x5DF1;&#x4E27;&#x5931;&#x95EE;&#x9898;&#x7684;&#x672C;&#x8D28;&#x601D;&#x8003;</p>
<hr>
<h3 id="&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4F1A;&#x6C89;&#x8FF7;&#x4E8E;&#x788E;&#x788E;&#x5FF5;&#xFF0C;or-&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x7ADF;&#x7136;&#x6CA1;&#x529E;&#x6CD5;&#x8A00;&#x7B80;&#x610F;&#x9A87;&#x7684;&#x8BF4;&#x70B9;&#x4E1C;&#x897F;&#xFF1F;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4F1A;&#x6C89;&#x8FF7;&#x4E8E;&#x788E;&#x788E;&#x5FF5;&#xFF0C;or-&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x7ADF;&#x7136;&#x6CA1;&#x529E;&#x6CD5;&#x8A00;&#x7B80;&#x610F;&#x9A87;&#x7684;&#x8BF4;&#x70B9;&#x4E1C;&#x897F;&#xFF1F;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4F1A;&#x6C89;&#x8FF7;&#x4E8E;&#x788E;&#x788E;&#x5FF5;&#xFF0C;or &#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x7ADF;&#x7136;&#x6CA1;&#x529E;&#x6CD5;&#x8A00;&#x7B80;&#x610F;&#x9A87;&#x7684;&#x8BF4;&#x70B9;&#x4E1C;&#x897F;&#xFF1F;"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4F1A;&#x6C89;&#x8FF7;&#x4E8E;&#x788E;&#x788E;&#x5FF5;&#xFF0C;or &#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x7ADF;&#x7136;&#x6CA1;&#x529E;&#x6CD5;&#x8A00;&#x7B80;&#x610F;&#x9A87;&#x7684;&#x8BF4;&#x70B9;&#x4E1C;&#x897F;&#xFF1F;</h3><p>&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x5019;&#x90FD;&#x662F;&#x7410;&#x788E;&#xFF0C;&#x6563;&#x6F2B;&#x7684;&#x3002;&#x6709;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x601D;&#x7EF4;&#x662F;&#x9700;&#x8981;&#x8BAD;&#x7EC3;&#xFF0C;&#x800C;&#x4E14;&#x6700;&#x597D;&#x6709;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x4F5C;&#x4E3A;&#x8F85;&#x52A9;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/思考/" rel="tag"><i class="fa fa-tag"></i>思考</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/09/18/ProgramStudy/JAVA/serialization/" rel="next" title="serialization">
                <i class="fa fa-chevron-left"></i> serialization
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/09/20/tools/geeknote/" rel="prev" title="Geetnote的安装和使用">
                Geetnote的安装和使用 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="//schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="陈22" />
          <p class="site-author-name" itemprop="name">陈22</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">11</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">16</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">18</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/jingchen2222" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-4"><a class="nav-link" href="#阅读材料一"><span class="nav-number">1.</span> <span class="nav-text">阅读材料一</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#阅读材料二"><span class="nav-number">2.</span> <span class="nav-text">阅读材料二</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#阅读材料三"><span class="nav-number">3.</span> <span class="nav-text">阅读材料三</span></a></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#为什么我们会沉迷于碎碎念，or-为什么我们竟然没办法言简意骇的说点东西？"><span class="nav-number"></span> <span class="nav-text">为什么我们会沉迷于碎碎念，or 为什么我们竟然没办法言简意骇的说点东西？</span></a></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">陈22</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

<script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js"></script>
<span id="busuanzi_container_site_pv">
    本站总访问量<span id="busuanzi_value_site_pv"></span>次
</span>
<span id="busuanzi_container_site_uv">
  本站访客数<span id="busuanzi_value_site_uv"></span>人次
</span>
<script>
  var birthDay = new Date("11/20/2014");
  var now = new Date();
  var duration = now.getTime() - birthDay.getTime();
  var total= Math.floor(duration / (1000 * 60 * 60 * 24));
  document.getElementById("showDays").innerHTML = "本站已运行 "+total+" 天";
</script>
<span id="showDays"></span>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.2"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.2"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.2"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.2"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.2"></script><!-- hexo-inject:begin --><!-- hexo-inject:end -->



  



  




  
  

  

  

  

  


</body>
</html>
